CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Source/gd32w51x_timer.c
/*!
    \brief      clear TIMER flags
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  flag: the timer interrupt flags
                only one parameter can be selected which is shown as below:
      \arg        TIMER_FLAG_UP: update flag,TIMERx(x=0..5,15,16)
      \arg        TIMER_FLAG_CH0: channel 0 flag,TIMERx(x=0..4,15,16)
      \arg        TIMER_FLAG_CH1: channel 1 flag,TIMERx(x=0..4)
      \arg        TIMER_FLAG_CH2: channel 2 flag,TIMERx(x=0..4)
      \arg        TIMER_FLAG_CH3: channel 3 flag,TIMERx(x=0..4)
      \arg        TIMER_FLAG_CMT: channel control update flag,TIMERx(x=0,15,16) 
      \arg        TIMER_FLAG_TRG: trigger flag,TIMERx(x=0..4) 
      \arg        TIMER_FLAG_BRK: break flag,TIMERx(x=0,15,16)
      \arg        TIMER_FLAG_CH0O: channel 0 overcapture flag,TIMERx(x=0..4,15,16)
      \arg        TIMER_FLAG_CH1O: channel 1 overcapture flag,TIMERx(x=0..4)
      \arg        TIMER_FLAG_CH2O: channel 2 overcapture flag,TIMERx(x=0..4)
      \arg        TIMER_FLAG_CH3O: channel 3 overcapture flag,TIMERx(x=0..4)
    \param[out] none
    \retval     none
*/
void timer_flag_clear(uint32_t timer_periph, uint32_t flag)
{
    TIMER_INTF(timer_periph) = (~(uint32_t)flag);
}
/*!
    \brief      enable the TIMER interrupt
    \param[in]  timer_periph: please refer to the following parameters 
    \param[in]  interrupt: timer interrupt enable source
                only one parameter can be selected which is shown as below:
      \arg        TIMER_INT_UP: update interrupt enable, TIMERx(x=0..5,15,16)
      \arg        TIMER_INT_CH0: channel 0 interrupt enable, TIMERx(x=0..4,15,16)
      \arg        TIMER_INT_CH1: channel 1 interrupt enable, TIMERx(x=0..4)
      \arg        TIMER_INT_CH2: channel 2 interrupt enable, TIMERx(x=0..4)
      \arg        TIMER_INT_CH3: channel 3 interrupt enable , TIMERx(x=0..4)
      \arg        TIMER_INT_CMT: commutation interrupt enable, TIMERx(x=0,15,16)
      \arg        TIMER_INT_TRG: trigger interrupt enable, TIMERx(x=0..4)
      \arg        TIMER_INT_BRK: break interrupt enable, TIMERx(x=0,15,16)
    \param[out] none
    \retval     none
*/
void timer_interrupt_enable(uint32_t timer_periph, uint32_t interrupt)
{
    TIMER_DMAINTEN(timer_periph) |= (uint32_t) interrupt; 
}

/*!
    \brief      disable the TIMER interrupt
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  interrupt: timer interrupt source disable 
                only one parameter can be selected which is shown as below:
      \arg        TIMER_INT_UP: update interrupt disable, TIMERx(x=0..5,15,16)
      \arg        TIMER_INT_CH0: channel 0 interrupt disable, TIMERx(x=0..4,15,16)
      \arg        TIMER_INT_CH1: channel 1 interrupt disable, TIMERx(x=0..4)
      \arg        TIMER_INT_CH2: channel 2 interrupt disable, TIMERx(x=0..4)
      \arg        TIMER_INT_CH3: channel 3 interrupt disable , TIMERx(x=0..4)
      \arg        TIMER_INT_CMT: commutation interrupt disable, TIMERx(x=0,15,16)
      \arg        TIMER_INT_TRG: trigger interrupt disable, TIMERx(x=0..4)
      \arg        TIMER_INT_BRK: break interrupt disable, TIMERx(x=0,15,16)
    \param[out] none
    \retval     none
*/
void timer_interrupt_disable(uint32_t timer_periph, uint32_t interrupt)
{
    TIMER_DMAINTEN(timer_periph) &= (~(uint32_t)interrupt); 
}

/*!
    \brief      get timer interrupt flag
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  int_flag: the timer interrupt bits
                only one parameter can be selected which is shown as below:
      \arg        TIMER_INT_FLAG_UP: update interrupt flag,TIMERx(x=0..5,15,16)
      \arg        TIMER_INT_FLAG_CH0: channel 0 interrupt flag,TIMERx(x=0..4,15,16)
      \arg        TIMER_INT_FLAG_CH1: channel 1 interrupt flag,TIMERx(x=0..4)
      \arg        TIMER_INT_FLAG_CH2: channel 2 interrupt flag,TIMERx(x=0..4)
      \arg        TIMER_INT_FLAG_CH3: channel 3 interrupt flag,TIMERx(x=0..4)
      \arg        TIMER_INT_FLAG_CMT: channel commutation interrupt flag,TIMERx(x=0,15,16) 
      \arg        TIMER_INT_FLAG_TRG: trigger interrupt flag,TIMERx(x=0..4)
      \arg        TIMER_INT_FLAG_BRK:  break interrupt flag,TIMERx(x=0,15,16)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus timer_interrupt_flag_get(uint32_t timer_periph, uint32_t int_flag)
{
    uint32_t val;
    val = (TIMER_DMAINTEN(timer_periph) & int_flag);
    if((RESET != (TIMER_INTF(timer_periph) & int_flag) ) && (RESET != val)){
        return SET;
    }else{
        return RESET;
    }
}

/*!
    \brief      clear TIMER interrupt flag
    \param[in]  timer_periph: please refer to the following parameters
    \param[in]  int_flag: the timer interrupt bits
                only one parameter can be selected which is shown as below:
      \arg        TIMER_INT_FLAG_UP: update interrupt flag,TIMERx(x=0..5,15,16)
      \arg        TIMER_INT_FLAG_CH0: channel 0 interrupt flag,TIMERx(x=0..4,15,16)
      \arg        TIMER_INT_FLAG_CH1: channel 1 interrupt flag,TIMERx(x=0..4)
      \arg        TIMER_INT_FLAG_CH2: channel 2 interrupt flag,TIMERx(x=0..4)
      \arg        TIMER_INT_FLAG_CH3: channel 3 interrupt flag,TIMERx(x=0..4)
      \arg        TIMER_INT_FLAG_CMT: channel commutation interrupt flag,TIMERx(x=0,15,16) 
      \arg        TIMER_INT_FLAG_TRG: trigger interrupt flag,TIMERx(x=0..4)
      \arg        TIMER_INT_FLAG_BRK:  break interrupt flag,TIMERx(x=0,15,16)
    \param[out] none
    \retval     none
*/
void timer_interrupt_flag_clear(uint32_t timer_periph, uint32_t int_flag)
{
    TIMER_INTF(timer_periph) = (~(uint32_t)int_flag);
}
